{
  "name": "Bridesmaid of Zuggtmoy",
  "slug_name": "bridesmaid-of-zuggtmoy",
  "tags": [
    "medium",
    "plant",
    "cr1/8",
    "out-of-the-abyss"
  ],
  "size": "Medium",
  "type": "plant",
  "subtype": null,
  "aligntment": "chaotic evil",
  "armor_class": "13",
  "armor_class_type": "natural armor",
  "hit_points": "22",
  "hit_dice": "5d8",
  "speed": "20 ft.",
  "strength": "14",
  "strength_modifier": "+2",
  "dexterity": "11",
  "dexterity_modifier": "+0",
  "constitution": "11",
  "constitution_modifier": "+0",
  "intelligence": "14",
  "intelligence_modifier": "+2",
  "wisdom": "8",
  "wisdom_modifier": "-1",
  "charisma": "18",
  "charisma_modifier": "+4",
  "saving_throws": null,
  "skills": null,
  "damage_resistances": null,
  "damage_immunities": null,
  "damage_vulnerabilities": null,
  "condition_immunities": null,
  "senses": "darkvision 60 ft.",
  "languages": "understands Abyssal but can't speak",
  "challenge_rating": "1/8",
  "challenge_rating_decimal": 0.125,
  "experience": "25 XP",
  "special_abilities": [
    {
      "name": "Fungus Stride.",
      "descriptions": [
        "Once on its turn, the bridesmaid can use 10 feet of its movement to step magically into one living mushroom or fungus patch within 5 feet and emerge from another within 60 feet of the first one, appearing in an unoccupied space within 5 feet of the second mushroom or fungus patch. The mushrooms and patches must be large or bigger."
      ]
    }
  ],
  "actions": [
    {
      "name": "Hallucination Spores.",
      "descriptions": [
        "The bridesmaid ejects spores at one creature it can see within 5 feet of it. The target must succeed on a DC 10 Constitution saving throw or be poisoned for 1 minute. While poisoned in this way, the target is incapacitated. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."
      ]
    },
    {
      "name": "Infestation Spores (1/Day).",
      "descriptions": [
        "The bridesmaid releases spores that burst out in a cloud that fills a 10-foot-radius sphere centered on it, and the cloud lingers for 1 minute. Any flesh-and-blood creature in the cloud when it appears, or that enters it later, must make a DC 10 Constitution saving throw. On a successful save, the creature can't be infected by these spores for 24 hours. On a failed save, the creature is infected with a disease called the spores of Zuggtmoy and also gains a random form of indefinite madness (determined by rolling on the Madness of Zuggtmoy table in appendix D) that lasts until the creature is cured of the disease or dies. While infected in this way, the creature can't be reinfected, and it must be repeat the saving throw at the end of every 24 hours, ending the infection on a success. On a failure, the infected creature's body is slowly taken over by fungal growth, and after three such failed saves, the creature dies and is reanimated as a spore servant if it's a type of creature that can be (see the \"Myconids\" entry in the Monster Manual)."
      ]
    }
  ]
}