{
  "name": "Chasme",
  "slug_name": "chasme",
  "tags": [
    "large",
    "fiend",
    "cr6",
    "monster-manual"
  ],
  "size": "Large",
  "type": "fiend",
  "subtype": "demon",
  "alignment": "chaotic evil",
  "armor_class": "15",
  "armor_class_type": "natural armor",
  "hit_points": "84",
  "hit_dice": "13d10+13",
  "speed": "20 ft., fly 60 ft.",
  "strength": "15",
  "strength_modifier": "+2",
  "dexterity": "15",
  "dexterity_modifier": "+2",
  "constitution": "12",
  "constitution_modifier": "+1",
  "intelligence": "11",
  "intelligence_modifier": "+0",
  "wisdom": "14",
  "wisdom_modifier": "+2",
  "charisma": "10",
  "charisma_modifier": "+0",
  "saving_throws": "Dex +5, Wis +5",
  "skills": "Perception +5",
  "damage_resistances": "cold, fire, lightning",
  "damage_immunities": "poison",
  "damage_vulnerabilities": null,
  "condition_immunities": "poisoned",
  "senses": "blindsight 10 ft., darkvision 120 ft.",
  "languages": "Abyssal, telepathy 120 ft.",
  "challenge_rating": "6",
  "challenge_rating_decimal": 6.0,
  "experience": "2,300 XP",
  "special_abilities": [
    {
      "name": "Drone.",
      "descriptions": [
        "The chasme produces a horrid droning sound to which demons are immune. Any other creature that starts its turn with in 30 feet of the chasme must succeed on a DC 12 Constitution saving throw or fall unconscious for 10 minutes. A creature that can't hear the drone automatically succeeds on the save. The effect on the creature ends if it takes damage or if another creature takes an action to splash it with holy water. If a creature's saving throw is successful or the effect ends for it, it is immune to the drone for the next 24 hours ."
      ]
    },
    {
      "name": "Magic Resistance.",
      "descriptions": [
        "The chasme has advantage on saving throws against spells and other magical effects."
      ]
    },
    {
      "name": "Spider Climb.",
      "descriptions": [
        "The chasme can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check."
      ]
    }
  ],
  "actions": [
    {
      "name": "Proboscis.",
      "descriptions": [
        "Melee Weapon Attack: +5 to hit, reach 5 ft., one creature. Hit: 16 (4d6 + 2) piercing damage plus 24 (7d6) necrotic damage, and the target's hit point maximum is reduced by an amount equal to the necrotic damage taken. If this effect reduces a creature's hit point maximum to 0, the creature dies. This reduction to a creature's hit point maximum lasts until the creature finishes a long rest or until it is affected by a spell like greater restoration ."
      ]
    },
    {
      "name": "Variant: Summon Demon (1/Day).",
      "descriptions": [
        "The demon chooses what to summon and attempts a magical summoning.",
        "A chasme has a 30 percent chance of summoning one chasme.",
        "A summoned demon appears in an unoccupied space within 60 feet of its summoner, acts as an ally of its summoner, and can't summon other demons. It remains for 1 minute, until it or its summoner dies, or until its summoner dismisses it as an action."
      ]
    }
  ]
}