{
  "name": "Demilich",
  "slug_name": "demilich",
  "tags": [
    "tiny",
    "undead",
    "cr18",
    "monster-manual"
  ],
  "size": "Tiny",
  "type": "undead",
  "subtype": null,
  "aligntment": "neutral evil",
  "armor_class": "20",
  "armor_class_type": "natural armor",
  "hit_points": "80",
  "hit_dice": "20d4",
  "speed": "0 ft., fly 30 ft. (hover)",
  "strength": "1",
  "strength_modifier": "-5",
  "dexterity": "20",
  "dexterity_modifier": "+5",
  "constitution": "10",
  "constitution_modifier": "+0",
  "intelligence": "20",
  "intelligence_modifier": "+5",
  "wisdom": "17",
  "wisdom_modifier": "+3",
  "charisma": "20",
  "charisma_modifier": "+5",
  "saving_throws": "Con +6, Int +11, Wis +9, Cha +11",
  "skills": null,
  "damage_resistances": "bludgeoning, piercing, and slashing from magic weapons",
  "damage_immunities": "necrotic, poison, psychic, bludgeoning, piercing, and slashing from nonmagical weapons",
  "damage_vulnerabilities": null,
  "condition_immunities": "charmed, deafened, exhaustion, frightened, paralyzed, petrified, poisoned, prone, stunned",
  "senses": "truesight 120 ft.",
  "languages": null,
  "challenge_rating": "18",
  "challenge_rating_decimal": 18.0,
  "experience": "20,000 XP",
  "special_abilities": [
    {
      "name": "Avoidance.",
      "descriptions": [
        "If the demilich is subjected to an effect that allows it to make a saving throw to take only half damage, it instead takes no damage if it succeeds on the saving throw, and only half damage if it fails."
      ]
    },
    {
      "name": "Legendary Resistance (3/Day).",
      "descriptions": [
        "If the demilich fails a saving throw, it can choose to succeed instead."
      ]
    },
    {
      "name": "Turn Immunity.",
      "descriptions": [
        "The demilich is immune to effects that turn undead."
      ]
    }
  ],
  "actions": [
    {
      "name": "Howl (Recharge 5-6).",
      "descriptions": [
        "The demilich emits a bloodcurdling howl. Each creature within 30 feet of the demilich that can hear the howl must succeed on a DC 15 Constitution saving throw or drop to 0 hit points. On a successful save, the creature is frightened until the end of its next turn."
      ]
    },
    {
      "name": "Life Drain.",
      "descriptions": [
        "The demilich targets up to three creatures that it can see within 10 feet of it. Each target must succeed on a DC 19 Constitution saving throw or take 21 (6d6) necrotic damage, and the demilich regains hit points equal to the total damage dealt to all targets."
      ]
    }
  ],
  "legendary_action_description": "The demilich can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time, and only at the end of another creature's turn. The demilich regains spent legendary actions at the start of its turn.",
  "legendary_actions": [
    {
      "name": "Flight.",
      "descriptions": [
        "The demilich flies up to half its flying speed."
      ]
    },
    {
      "name": "Cloud of Dust.",
      "descriptions": [
        "The demilich magically swirls its dusty remains. Each creature within 10 feet of the demilich, including around a corner, must succeed on a DC 15 Constitution saving throw or be blinded until the end of the demilich's next turn. A creature that succeeds on the saving throw is immune to this effect until the end of the demilich's next turn."
      ]
    },
    {
      "name": "Energy Drain (Costs 2 Actions).",
      "descriptions": [
        "Each creature with in 30 feet of the demilich must make a DC 15 Constitution saving throw. On a failed save, the creature's hit point maximum is magically reduced by 10 (3d6). If a creature's hit point maximum is reduced to 0 by this effect, the creature dies. A creature's hit point maximum can be restored with the greater restoration spell or similar magic."
      ]
    },
    {
      "name": "Vile Curse (Costs 3 Actions).",
      "descriptions": [
        "The demilich targets one creature it can see within 30 feet of it. The target must succeed on a DC 15 Wisdom saving throw or be magically cursed. Until the curse ends, the target has disadvantage on attack rolls and saving throws. The target can repeat the saving throw at the end of each of its turns, ending the curse on a success."
      ]
    }
  ]
}