{
  "name": "Djinni",
  "slug_name": "djinni",
  "tags": [
    "large",
    "elemental",
    "cr11",
    "monster-manual"
  ],
  "size": "Large",
  "type": "elemental",
  "subtype": null,
  "alignment": "chaotic good",
  "armor_class": "17",
  "armor_class_type": "natural armor",
  "hit_points": "161",
  "hit_dice": "14d10+84",
  "speed": "30 ft., fly 90 ft.",
  "strength": "21",
  "strength_modifier": "+5",
  "dexterity": "15",
  "dexterity_modifier": "+2",
  "constitution": "22",
  "constitution_modifier": "+6",
  "intelligence": "15",
  "intelligence_modifier": "+2",
  "wisdom": "16",
  "wisdom_modifier": "+3",
  "charisma": "20",
  "charisma_modifier": "+5",
  "saving_throws": "Dex +6, Wis +7, Cha +9",
  "skills": null,
  "damage_resistances": null,
  "damage_immunities": "lightning, thunder",
  "damage_vulnerabilities": null,
  "condition_immunities": null,
  "senses": "darkvision 120 ft.",
  "languages": "Auran",
  "challenge_rating": "11",
  "challenge_rating_decimal": 11.0,
  "experience": "7,200 XP",
  "special_abilities": [
    {
      "name": "Elemental Demise.",
      "descriptions": [
        "If the djinni dies, its body disintegrates into a warm breeze, leaving behind only equipment the djinni was wearing or carrying."
      ]
    },
    {
      "name": "Innate Spellcasting.",
      "descriptions": [
        "The djinni's innate spellcasting ability is Charisma (spell save DC 17, +9 to hit with spell attacks). It can innately cast the following spells, requiring no material components: ",
        {
          "raw": "At will: detect evil and good, detect magic, thunderwave",
          "hyperlinked": "At will: <a target=\"_blank\" href=\"/spell/detect-evil-and-good\">detect evil and good</a>, <a target=\"_blank\" href=\"/spell/detect-magic\">detect magic</a>, <a target=\"_blank\" href=\"/spell/thunderwave\">thunderwave</a>"
        },
        {
          "raw": "3/day each: create food and water (can create wine instead of water), tongues, wind walk",
          "hyperlinked": "3/day each: <a target=\"_blank\" href=\"/spell/create-food-and-water\">create food and water</a> (can create wine instead of water), <a target=\"_blank\" href=\"/spell/tongues\">tongues</a>, <a target=\"_blank\" href=\"/spell/wind-walk\">wind walk</a>"
        },
        {
          "raw": "1/day each: conjure elemental (air elemental only), creation, gaseous form, invisibility, major image, plane shift",
          "hyperlinked": "1/day each: <a target=\"_blank\" href=\"/spell/conjure-elemental\">conjure elemental</a> (air elemental only), <a target=\"_blank\" href=\"/spell/creation\">creation</a>, <a target=\"_blank\" href=\"/spell/gaseous-form\">gaseous form</a>, <a target=\"_blank\" href=\"/spell/invisibility\">invisibility</a>, <a target=\"_blank\" href=\"/spell/major-image\">major image</a>, <a target=\"_blank\" href=\"/spell/plane-shift\">plane shift</a>"
        }
      ]
    },
    {
      "name": "Variant: Genie Powers.",
      "descriptions": [
        "Genies have a variety of magical capabilities, including spells. A few have even greater powers that allow them to alter their appearance or the nature of reality.",
        "Disguises.",
        "Some genies can veil themselves in illusion to pass as other similarly shaped creatures. Such genies can innately cast the disguise self spell at will, often with a longer duration than is normal for that spell. Mightier genies can cast the true polymorph spell one to three times per day, possibly with a longer duration than normal. Such genies can change only their own shape, but a rare few can use the spell on other creatures and objects as well.",
        "Wishes.",
        "The genie power to grant wishes is legendary among mortals. Only the most potent genies, such as those among the nobility, can do so. A particular genie that has this power can grant one to three wishes to a creature that isn't a genie. Once a genie has granted its limit of wishes, it can't grant wishes again for some amount of time (usually 1 year). and cosmic law dictates that the same genie can expend its limit of wishes on a specific creature only once in that creature's existence.",
        "To be granted a wish, a creature within 60 feet of the genie states a desired effect to it. The genie can then cast the wish spell on the creature's behalf to bring about the effect. Depending on the genie's nature, the genie might try to pervert the intent of the wish by exploiting the wish's poor wording. The perversion of the wording is usually crafted to be to the genie's benefit."
      ]
    }
  ],
  "actions": [
    {
      "name": "Multiattack.",
      "descriptions": [
        "The djinni makes three scimitar attacks."
      ]
    },
    {
      "name": "Scimitar.",
      "descriptions": [
        "Melee Weapon Attack: +9 to hit, reach 5 ft., one target. Hit: 12 (2d6 + 5) slashing damage plus 3 (1d6) lightning or thunder damage (djinni's choice)."
      ]
    },
    {
      "name": "Create Whirlwind.",
      "descriptions": [
        "A 5-foot-radius, 30-foot-tall cylinder of swirling air magically forms on a point the djinni can see within 120 feet of it. The whirlwind lasts as long as the djinni maintains concentration (as if concentrating on a spell). Any creature but the djinni that enters the whirlwind must succeed on a DC 18 Strength saving throw or be restrained by it. The djinni can move the whirlwind up to 60 feet as an action, and creatures restrained by the whirlwind move with it. The whirlwind ends if the djinni loses sight of it.",
        "A creature can use its action to free a creature restrained by the whirlwind, including itself, by succeeding on a DC 18 Strength check. If the check succeeds, the creature is no longer restrained and moves to the nearest space outside the whirlwind."
      ]
    }
  ]
}