{
  "name": "Iymrith, Ancient Blue Dragon",
  "slug_name": "iymrith-ancient-blue-dragon",
  "tags": [
    "gargantuan",
    "dragon",
    "cr23",
    "monster-manual"
  ],
  "size": "Gargantuan",
  "type": "dragon",
  "subtype": null,
  "aligntment": "lawful evil",
  "armor_class": "22",
  "armor_class_type": "natural armor",
  "hit_points": "481",
  "hit_dice": "26d20+208",
  "speed": "40 ft., burrow 40 ft., fly 80 ft.",
  "strength": "29",
  "strength_modifier": "+9",
  "dexterity": "10",
  "dexterity_modifier": "+0",
  "constitution": "27",
  "constitution_modifier": "+8",
  "intelligence": "18",
  "intelligence_modifier": "+4",
  "wisdom": "17",
  "wisdom_modifier": "+3",
  "charisma": "21",
  "charisma_modifier": "+5",
  "saving_throws": "Dex +7, Con +15, Wis +10, Cha +12",
  "skills": "Perception +17, Stealth +7",
  "damage_resistances": null,
  "damage_immunities": "lightning",
  "damage_vulnerabilities": null,
  "condition_immunities": null,
  "senses": "blindsight 60 ft., darkvision 120 ft.",
  "languages": "Common, Draconic, Giant, Terran",
  "challenge_rating": "23",
  "challenge_rating_decimal": 23.0,
  "experience": "50,000 XP",
  "special_abilities": [
    {
      "name": "Innate Spellcasting.",
      "descriptions": [
        "Iymrith's innate spellcasting ability is Charisma (spell save DC 20).  Iymrith's stone shape can create a living gargoyle instead of altering the stone as described in the spell description. She can innately cast the following spells, requiring no material components: ",
        "1/day: counterspell, detect magic, ice storm, stone shape, teleport"
      ]
    }
  ],
  "actions": [
    {
      "name": "Multiattack.",
      "descriptions": [
        "The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws."
      ]
    },
    {
      "name": "Bite.",
      "descriptions": [
        "Melee Weapon Attack: +16 to hit, reach 15 ft., one target. Hit: 20 (2d10 + 9) piercing damage plus 11 (2d10) lightning damage."
      ]
    },
    {
      "name": "Claw.",
      "descriptions": [
        "Melee Weapon Attack: +16 to hit, reach 10 ft., one target. Hit: 16 (2d6 + 9) slashing damage."
      ]
    },
    {
      "name": "Tail.",
      "descriptions": [
        "Melee Weapon Attack: +16 to hit, reach 20 ft., one target. Hit: 18 (2d8 + 9) bludgeoning damage."
      ]
    },
    {
      "name": "Frightful Presence.",
      "descriptions": [
        "Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 20 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours."
      ]
    },
    {
      "name": "Lightning Breath (Recharge 5-6).",
      "descriptions": [
        "The dragon exhales lightning in a 120-foot line that is 10 feet wide. Each creature in that line must make a DC 23 Dexterity saving throw, taking 88 (16d10) lightning damage on a failed save, or half as much damage on a successful one."
      ]
    },
    {
      "name": "Change Shape.",
      "descriptions": [
        "Iymrith magically polymorphs into a female storm giant or back into her true form. She reverts to her true form if she dies. Any equipment she is wearing or carrying is absorbed or borne by the new form (the dragon's choice).",
        "In storm giant form, Iymrith retains her alignment, hit points, Hit Dice, ability to speak, proficiencies, Legendary Resistance, lair actions, and Intelligence, Wisdom, and Charisma scores, as well as this action. Her statistics are otherwise replaced by those of the new form."
      ]
    }
  ],
  "legendary_action_description": "The iymrith, ancient blue dragon can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time, and only at the end of another creature's turn. The iymrith, ancient blue dragon regains spent legendary actions at the start of its turn.",
  "legendary_actions": [
    {
      "name": "Detect.",
      "descriptions": [
        "The dragon makes a Wisdom (Perception) check."
      ]
    },
    {
      "name": "Tail Attack.",
      "descriptions": [
        "The dragon makes a tail attack."
      ]
    },
    {
      "name": "Wing Attack (Costs 2 Actions).",
      "descriptions": [
        "The dragon beats its wings. Each creature within 15 ft. of the dragon must succeed on a DC 24 Dexterity saving throw or take 16 (2d6 + 9) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed."
      ]
    }
  ]
}