{
  "name": "Kelpie",
  "slug_name": "kelpie",
  "tags": [
    "medium",
    "plant",
    "cr4",
    "tales-from-the-yawning-portal"
  ],
  "size": "Medium",
  "type": "plant",
  "subtype": null,
  "alignment": "neutral evil",
  "armor_class": "14",
  "armor_class_type": "natural armor",
  "hit_points": "67",
  "hit_dice": "9d8+27",
  "speed": "10 ft., swim 30 ft.",
  "strength": "14",
  "strength_modifier": "+2",
  "dexterity": "14",
  "dexterity_modifier": "+2",
  "constitution": "16",
  "constitution_modifier": "+3",
  "intelligence": "7",
  "intelligence_modifier": "-2",
  "wisdom": "12",
  "wisdom_modifier": "+1",
  "charisma": "10",
  "charisma_modifier": "+0",
  "saving_throws": null,
  "skills": "Perception +3, Stealth +4",
  "damage_resistances": "bludgeoning, fire, piercing",
  "damage_immunities": null,
  "damage_vulnerabilities": null,
  "condition_immunities": "blinded, deafened, exhaustion",
  "senses": "blindsight 60 ft.",
  "languages": "Common, Sylvan",
  "challenge_rating": "4",
  "challenge_rating_decimal": 4.0,
  "experience": "1,100 XP",
  "special_abilities": [
    {
      "name": "Source.",
      "descriptions": [
        "tales from the yawning portal,  page 238"
      ]
    },
    {
      "name": "Amphibious.",
      "descriptions": [
        "The kelpie can breathe air and water."
      ]
    },
    {
      "name": "Seaweed Shape.",
      "descriptions": [
        "The kelpie can use its action to reshape its body into the form of a humanoid or beast that is Small, Medium, or Large. Its statistics are otherwise unchanged. The disguise is convincing, unless the kelpie is in bright light or the viewer is within 30 feet of it, in which case the seams between the seaweed strands are visible. The kelpie returns to its true form if takes a bonus action to do so or if it dies."
      ]
    },
    {
      "name": "False Appearance.",
      "descriptions": [
        "While the kelpie remains motionless in its true form, it is indistinguishable from normal seaweed."
      ]
    }
  ],
  "actions": [
    {
      "name": "Multiattack.",
      "descriptions": [
        "The kelpie makes two slam attacks."
      ]
    },
    {
      "name": "Slam.",
      "descriptions": [
        "Melee Weapon Attack: +4 to hit, reach 10 ft., one target. Hit: 11 (2d8 + 2) piercing damage. If the target is a Medium or smaller creature, it is grappled (escape DC 12)."
      ]
    },
    {
      "name": "Drowning Hypnosis.",
      "descriptions": [
        "The kelpie chooses one humanoid it can see within 150 feet of it. If the target can see the kelpie, the target must succeed on a DC 11 Wisdom saving throw or be magically charmed while the kelpie maintains concentration, up to 10 minutes (as if concentrating on a spell).",
        ">The charmed target is incapacitated, and instead of holding its breath underwater, it tries to breathe normally and immediately runs out of breath, unless it can breathe water.",
        ">If the charmed target is more than 5 feet away from the kelpie, the target must move on its turn toward the kelpie by the most direct route, trying to get within 5 feet. It doesn't avoid opportunity attacks.",
        ">Before moving into damaging terrain, such as lava or a pit, and whenever it takes damage from a source other than the kelpie or drowning, the target can repeat the saving throw. A charmed target can also repeat the saving throw at the end of each of its turns. If the saving throw is successful, the effect ends on it.",
        ">A target that successfully saves is immune to this kelpie's hypnosis for the next 24 hours."
      ]
    }
  ]
}