{
  "name": "Marid",
  "slug_name": "marid",
  "tags": [
    "large",
    "elemental",
    "cr11",
    "monster-manual"
  ],
  "size": "Large",
  "type": "elemental",
  "subtype": null,
  "alignment": "chaotic neutral",
  "armor_class": "17",
  "armor_class_type": "natural armor",
  "hit_points": "229",
  "hit_dice": "17d10+136",
  "speed": "30 ft., fly 60 ft., swim 90 ft.",
  "strength": "22",
  "strength_modifier": "+6",
  "dexterity": "12",
  "dexterity_modifier": "+1",
  "constitution": "26",
  "constitution_modifier": "+8",
  "intelligence": "18",
  "intelligence_modifier": "+4",
  "wisdom": "17",
  "wisdom_modifier": "+3",
  "charisma": "18",
  "charisma_modifier": "+4",
  "saving_throws": "Dex +5, Wis +7, Cha +8",
  "skills": null,
  "damage_resistances": "acid, cold, lightning",
  "damage_immunities": null,
  "damage_vulnerabilities": null,
  "condition_immunities": null,
  "senses": "blindsight 30 ft., darkvision 120 ft.",
  "languages": "Aquan",
  "challenge_rating": "11",
  "challenge_rating_decimal": 11.0,
  "experience": "7,200 XP",
  "special_abilities": [
    {
      "name": "Amphibious.",
      "descriptions": [
        "The marid can breathe air and water."
      ]
    },
    {
      "name": "Elemental Demise.",
      "descriptions": [
        "If the marid dies, its body disintegrates into a burst of water and foam, leaving behind only equipment the marid was wearing or carrying."
      ]
    },
    {
      "name": "Innate Spellcasting.",
      "descriptions": [
        "The marid's innate spellcasting ability is Charisma (spell save DC 16, +8 to hit with spell attacks). It can innately cast the following spells, requiring no material components: ",
        {
          "raw": "At will: create or destroy water, detect evil and good, detect magic, fog cloud, purify food and drink",
          "hyperlinked": "At will: <a href=\"/spell/create-or-destroy-water\">create or destroy water</a>, <a href=\"/spell/detect-evil-and-good\">detect evil and good</a>, <a href=\"/spell/detect-magic\">detect magic</a>, <a href=\"/spell/fog-cloud\">fog cloud</a>, <a href=\"/spell/purify-food-and-drink\">purify food and drink</a>"
        },
        {
          "raw": "3/day each: tongues, water breathing, water walk",
          "hyperlinked": "3/day each: <a href=\"/spell/tongues\">tongues</a>, <a href=\"/spell/water-breathing\">water breathing</a>, <a href=\"/spell/water-walk\">water walk</a>"
        },
        {
          "raw": "1/day each: conjure elemental (water elemental only), control water, gaseous form, invisibility, plane shift",
          "hyperlinked": "1/day each: <a href=\"/spell/conjure-elemental\">conjure elemental</a> (water elemental only), <a href=\"/spell/control-water\">control water</a>, <a href=\"/spell/gaseous-form\">gaseous form</a>, <a href=\"/spell/invisibility\">invisibility</a>, <a href=\"/spell/plane-shift\">plane shift</a>"
        }
      ]
    },
    {
      "name": "Variant: Genie Powers.",
      "descriptions": [
        "Genies have a variety of magical capabilities, including spells. A few have even greater powers that allow them to alter their appearance or the nature of reality.",
        "Disguises.",
        "Some genies can veil themselves in illusion to pass as other similarly shaped creatures. Such genies can innately cast the disguise self spell at will, often with a longer duration than is normal for that spell. Mightier genies can cast the true polymorph spell one to three times per day, possibly with a longer duration than normal. Such genies can change only their own shape, but a rare few can use the spell on other creatures and objects as well.",
        "Wishes.",
        "The genie power to grant wishes is legendary among mortals. Only the most potent genies, such as those among the nobility, can do so. A particular genie that has this power can grant one to three wishes to a creature that isn't a genie. Once a genie has granted its limit of wishes, it can't grant wishes again for some amount of time (usually 1 year). and cosmic law dictates that the same genie can expend its limit of wishes on a specific creature only once in that creature's existence.",
        "To be granted a wish, a creature within 60 feet of the genie states a desired effect to it. The genie can then cast the wish spell on the creature's behalf to bring about the effect. Depending on the genie's nature, the genie might try to pervert the intent of the wish by exploiting the wish's poor wording. The perversion of the wording is usually crafted to be to the genie's benefit."
      ]
    }
  ],
  "actions": [
    {
      "name": "Multiattack.",
      "descriptions": [
        "The marid makes two trident attacks."
      ]
    },
    {
      "name": "Trident.",
      "descriptions": [
        "Melee or Ranged Weapon Attack: +10 to hit, reach 5 ft. or range 20/60 ft., one target. Hit: 13 (2d6 + 6) piercing damage, or 15 (2d8 + 6) piercing damage if used with two hands to make a melee attack."
      ]
    },
    {
      "name": "Water Jet.",
      "descriptions": [
        "The marid magically shoots water in a 60-foot line that is 5 feet wide. Each creature in that line must make a DC 16 Dexterity saving throw. On a failure, a target takes 21 (6d6) bludgeoning damage and, if it is Huge or smaller, is pushed up to 20 feet away from the marid and knocked prone. On a success, a target takes half the bludgeoning damage, but is neither pushed nor knocked prone."
      ]
    }
  ]
}
