{
  "name": "Marlos Urnrayle",
  "slug_name": "marlos-urnrayle",
  "tags": [
    "medium",
    "monstrosity",
    "cr8",
    "elemental-evil"
  ],
  "size": "Medium",
  "type": "monstrosity",
  "subtype": null,
  "alignment": "neutral evil",
  "armor_class": "15",
  "armor_class_type": "natural armor",
  "hit_points": "136",
  "hit_dice": "16d8+64",
  "speed": "30 ft.",
  "strength": "17",
  "strength_modifier": "+3",
  "dexterity": "11",
  "dexterity_modifier": "+0",
  "constitution": "18",
  "constitution_modifier": "+4",
  "intelligence": "12",
  "intelligence_modifier": "+1",
  "wisdom": "13",
  "wisdom_modifier": "+1",
  "charisma": "17",
  "charisma_modifier": "+3",
  "saving_throws": null,
  "skills": "Arcana +4, Deception +6, Perception +4",
  "damage_resistances": "acid",
  "damage_immunities": null,
  "damage_vulnerabilities": null,
  "condition_immunities": null,
  "senses": "darkvision 60 ft., tremorsense 60 ft.",
  "languages": "Common, Terran",
  "challenge_rating": "8",
  "challenge_rating_decimal": 8.0,
  "experience": "3,900 XP",
  "special_abilities": [
    {
      "name": "Earthen Defeat.",
      "descriptions": [
        "When Marlos drops to 0 hit points, his body transforms into mud and collapses into a pool. Anything he is wearing or carrying is left behind."
      ]
    },
    {
      "name": "Earth Passage.",
      "descriptions": [
        "Marlos can move in difficult terrain composed of anything made from earth or stone as if it were normal terrain. He can move through solid earth and rock as if it were difficult terrain. If he ends his turn there, he is shunted into the nearest space he last occupied."
      ]
    },
    {
      "name": "Legendary Resistance (2/Day).",
      "descriptions": [
        "If Marlos fails a saving throw, he can choose to succeed instead."
      ]
    },
    {
      "name": "Petrifying Gaze.",
      "descriptions": [
        "When a creature that can see Marlos's eyes starts its turn within 30 feet of him, Marlos can force it to make a DC 14 Constitution saving throw if Marlos isn't incapacitated and can see the creature. If the saving throw fails by 5 or more, the creature is instantly petrified. Otherwise, a creature that fails the save begins to turn to stone and is restrained. The restrained creature must repeat the saving throw at the end of its next turn, becoming petrified on a failure or ending the effect on a success. The petrification lasts until the creature is freed by the greater restoration spell or other magic.",
        "Unless surprised, a creature can avert its eyes to avoid the saving throw at the start of its turn. If the creature does so, it can't see Marlos until the start of its next turn, when it can decide to avert its eyes again. If the creature looks at Marlos in the meantime, it must immediately make the save.",
        "If Marlos sees himself reflected on a polished surface within 30 feet of him and in an area of bright light, Marlos is, due to his curse, affected by his own gaze."
      ]
    }
  ],
  "actions": [
    {
      "name": "Multiattack.",
      "descriptions": [
        "Marlos makes three melee attacks, one with his snake hair and two with Ironfang."
      ]
    },
    {
      "name": "Snake Hair.",
      "descriptions": [
        "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 7 (1d8 + 3) piercing damage plus 14 (4d6) poison damage."
      ]
    },
    {
      "name": "Ironfang.",
      "descriptions": [
        "Melee Weapon Attack: +9 to hit, reach 5 ft., one target. Hit: 7 (1d8 + 3) piercing damage plus 4 (1d8) thunder damage."
      ]
    }
  ]
}