{
  "name": "Red Slaad",
  "slug_name": "red-slaad",
  "tags": [
    "large",
    "aberration",
    "cr5",
    "monster-manual"
  ],
  "size": "Large",
  "type": "aberration",
  "subtype": null,
  "alignment": "chaotic neutral",
  "armor_class": "14",
  "armor_class_type": "natural armor",
  "hit_points": "93",
  "hit_dice": "11d10+33",
  "speed": "30 ft.",
  "strength": "16",
  "strength_modifier": "+3",
  "dexterity": "12",
  "dexterity_modifier": "+1",
  "constitution": "16",
  "constitution_modifier": "+3",
  "intelligence": "6",
  "intelligence_modifier": "-2",
  "wisdom": "6",
  "wisdom_modifier": "-2",
  "charisma": "7",
  "charisma_modifier": "-2",
  "saving_throws": null,
  "skills": "Perception +1",
  "damage_resistances": "acid, cold, fire, lightning, thunder",
  "damage_immunities": null,
  "damage_vulnerabilities": null,
  "condition_immunities": null,
  "senses": "darkvision 60 ft.",
  "languages": "Slaad, telepathy 60 ft.",
  "challenge_rating": "5",
  "challenge_rating_decimal": 5.0,
  "experience": "1,800 XP",
  "special_abilities": [
    {
      "name": "Magic Resistance.",
      "descriptions": [
        "The slaad has advantage on saving throws against spells and other magical effects"
      ]
    },
    {
      "name": "Regeneration.",
      "descriptions": [
        "The slaad regains 10 hit points at the start of its turn if it has at least 1 hit point."
      ]
    },
    {
      "name": "Variant: Control Gem.",
      "descriptions": [
        "Implanted in the slaad's brain is a magic control gem. The slaad must obey whoever possesses the gem and is immune to being charmed while so controlled.",
        "Certain spells can be used to acquire the gem. If the slaad fails its saving throw against imprisonment, the spell can transfer the gem to the spellcaster's open hand, instead of imprisoning the slaad. A wish spell, if cast in the slaad's presence, can be worded to acquire the gem.",
        "A greater restoration spell cast on the slaad destroys the gem without harming the slaad.",
        "Someone who is proficient in Wisdom (Medicine) can remove the gem from an incapacitated slaad. Each try requires 1 minute of uninterrupted work and a successful DC 20 Wisdom (Medicine) check. Each failed attempt deals 22 (4d10) psychic damage to the slaad."
      ]
    }
  ],
  "actions": [
    {
      "name": "Multiattack.",
      "descriptions": [
        "The slaad makes three attacks: one with its bite and two with its claws."
      ]
    },
    {
      "name": "Bite.",
      "descriptions": [
        "Melee Weapon Attack: +6 to hit, reach 5 ft., one target.",
        "Hit: 8 (2d4 + 3) piercing damage."
      ]
    },
    {
      "name": "Claw.",
      "descriptions": [
        "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 7 (1d8 + 3) piercing damage. If the target is a humanoid, it must succeed on a DC 14 Constitution saving throw or be infected with a disease - a minuscule slaad egg.",
        "A humanoid host can carry only one slaad egg to term at a time. Over three months, the egg moves to the chest cavity, gestates, and forms a slaad tadpole. In the 24-hour period before giving birth, the host starts to feel unwell, its speed is halved, and it has disadvantage on attack rolls, ability checks, and saving throws. At birth, the tadpole chews its way through vital organs and out of the host's chest in 1 round, killing the host in the process.",
        "If the disease is cured before the tadpole's emergence, the unborn slaad is disintegrated."
      ]
    }
  ]
}
