{
  "name": "Severin",
  "slug_name": "severin",
  "tags": [
    "medium",
    "humanoid",
    "cr11",
    "tyranny-of-dragons"
  ],
  "size": "Medium",
  "type": "humanoid",
  "subtype": "human",
  "alignment": "neutral evil",
  "armor_class": "16",
  "armor_class_type": null,
  "hit_points": "150",
  "hit_dice": "20d8+60",
  "speed": "30 ft.",
  "strength": "10",
  "strength_modifier": "+0",
  "dexterity": "13",
  "dexterity_modifier": "+1",
  "constitution": "16",
  "constitution_modifier": "+3",
  "intelligence": "17",
  "intelligence_modifier": "+3",
  "wisdom": "12",
  "wisdom_modifier": "+1",
  "charisma": "20",
  "charisma_modifier": "+5",
  "saving_throws": "Dex +5, Wis +5",
  "skills": "Arcana +7, Religion +7",
  "damage_resistances": "While wearing the mask of the Dragon Queen: acid, cold, lightning, poison; bludgeoning, piercing, and slashing damage from nonmagical weapons",
  "damage_immunities": "While wearing the mask of the Dragon Queen: fire",
  "damage_vulnerabilities": null,
  "condition_immunities": "While wearing the mask of the Dragon Queen: charmed, frightened, poisoned",
  "senses": "While wearing the Mask of the Dragon Queen: darkvision 60 ft.",
  "languages": "Common, Draconic, Infernal",
  "challenge_rating": "11",
  "challenge_rating_decimal": 11.0,
  "experience": "7,200 XP",
  "special_abilities": [
    {
      "name": "Special Equipment.",
      "descriptions": [
        "Severin has the Mask of the Dragon Queen."
      ]
    },
    {
      "name": "Draconic Majesty.",
      "descriptions": [
        "Severin adds his Charisma bonus to his AC (included)."
      ]
    },
    {
      "name": "Ignite Enemy.",
      "descriptions": [
        "If Severin deals fire damage to a creature while wearing the Mask of the Dragon Queen, the target catches fire. At the start of each of its turns, the burning target takes 5 (1d10) fire damage. A creature within reach of the fire can use an action to extinguish it."
      ]
    },
    {
      "name": "Legendary Resistance (5/Day).",
      "descriptions": [
        "While wearing the Mask of the Dragon Queen, if Severin fails a saving throw, he can choose to succeed instead."
      ]
    }
  ],
  "actions": [
    {
      "name": "Burning Touch.",
      "descriptions": [
        "Melee Spell Attack: +5 to hit, reach 5 ft., one target. Hit: 18 (4d8) fire damage."
      ]
    },
    {
      "name": "Flaming Orb.",
      "descriptions": [
        "Ranged Spell Attack: +5 to hit, range 90 ft., one target. Hit: 40 (9d8) fire damage."
      ]
    },
    {
      "name": "Scorching Burst.",
      "descriptions": [
        "Severin chooses a point he can see within 60 feet of him. Each creature within 5 feet of that point must make a DC 17 Dexterity saving throw, taking 18 (4d8) fire damage on a failed save, or half as much damage on a successful one."
      ]
    }
  ],
  "legendary_action_description": "If Severin is wearing the Mask of the Dragon Queen, he can take 3 legendary actions, choosing from the options listed. Only one legendary action option can be used at a time and only at the end of another creature's turn. Severin regains spent legendary actions at the start of his turn.",
  "legendary_actions": [
    {
      "name": "Attack.",
      "descriptions": [
        "Severin makes one attack."
      ]
    },
    {
      "name": "Fiery Teleport (Costs 2 Actions).",
      "descriptions": [
        "Severin, along with any objects he is wearing or carrying, teleports up to 60 feet to an unoccupied space he can see. Each creature within 5 feet of Severin before he teleports takes 5 (1d10) fire damage."
      ]
    },
    {
      "name": "Hellish Chains (Costs 3 Actions).",
      "descriptions": [
        "Severin targets one creature he can see within 30 feet of him. The target is wrapped in magical chains of fire and restrained. The restrained target takes 21 (6d6) fire damage at the start of each of its turns. At the end of its turns, the target can make a DC 17 Strength saving throw, ending the effect on itself on a success."
      ]
    }
  ]
}
