{
  "name": "Succubus/Incubus",
  "slug_name": "succubus-incubus",
  "tags": [
    "medium",
    "fiend",
    "cr4",
    "monster-manual"
  ],
  "size": "Medium",
  "type": "fiend",
  "subtype": "shapechanger",
  "alignment": "neutral evil",
  "armor_class": "15",
  "armor_class_type": "natural armor",
  "hit_points": "66",
  "hit_dice": "12d8+12",
  "speed": "30 ft., fly 60 ft.",
  "strength": "8",
  "strength_modifier": "-1",
  "dexterity": "17",
  "dexterity_modifier": "+3",
  "constitution": "13",
  "constitution_modifier": "+1",
  "intelligence": "15",
  "intelligence_modifier": "+2",
  "wisdom": "12",
  "wisdom_modifier": "+1",
  "charisma": "20",
  "charisma_modifier": "+5",
  "saving_throws": null,
  "skills": "Deception +9, Insight +5, Perception +5, Persuasion +9, Stealth +7",
  "damage_resistances": "cold, fire, lightning, poison, bludgeoning, piercing, and slashing from nonmagical weapons",
  "damage_immunities": null,
  "damage_vulnerabilities": null,
  "condition_immunities": null,
  "senses": "darkvision 60 ft.",
  "languages": "Abyssal, Common, Infernal, telepathy 60 ft.",
  "challenge_rating": "4",
  "challenge_rating_decimal": 4.0,
  "experience": "1,100 XP",
  "special_abilities": [
    {
      "name": "Telepathic Bond.",
      "descriptions": [
        "The fiend ignores the range restriction on its telepathy when communicating with a creature it has charmed. The two don't even need to be on the same plane of existence."
      ]
    },
    {
      "name": "Shapechanger.",
      "descriptions": [
        "The fiend can use its action to polymorph into a Small or Medium humanoid, or back into its true form. Without wings, the fiend loses its flying speed. Other than its size and speed, its statistics are the same in each form. Any equipment it is wearing or carrying isn't transformed. It reverts to its true form if it dies."
      ]
    }
  ],
  "actions": [
    {
      "name": "Thunderous Stomp (Recharge 6).",
      "descriptions": [
        "The storm giant stomps the ground, triggering a thunderclap. All other creatures within 15 feet of the giant must succeed on a DC 17 Constitution saving throw or take 33 (6d10) thunder damage and be deafened until the start of the giant's next turn. On a successful save, a creature takes half as much damage and isn't deafened. The thunderclap can be heard out to a range of 1,200 feet."
      ]
    },
    {
      "name": "Claw (Fiend Form Only).",
      "descriptions": [
        "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 6 (1d6 + 3) slashing damage."
      ]
    },
    {
      "name": "Charm.",
      "descriptions": [
        "One humanoid the fiend can see within 30 feet of it must succeed on a DC 15 Wisdom saving throw or be magically charmed for 1 day. The charmed target obeys the fiend's verbal or telepathic commands. If the target suffers any harm or receives a suicidal command, it can repeat the saving throw, ending the effect on a success. If the target successfully saves against the effect, or if the effect on it ends, the target is immune to this fiend's Charm for the next 24 hours.",
        "The fiend can have only one target charmed at a time. If it charms another, the effect on the previous target ends."
      ]
    },
    {
      "name": "Draining Kiss.",
      "descriptions": [
        "The fiend kisses a creature charmed by it or a willing creature. The target must make a DC 15 Constitution saving throw against this magic, taking 32 (5d10 + 5) psychic damage on a failed save, or half as much damage on a successful one. The target's hit point maximum is reduced by an amount equal to the damage taken. This reduction lasts until the target finishes a long rest. The target dies if this effect reduces its hit point maximum to 0."
      ]
    },
    {
      "name": "Etherealness.",
      "descriptions": [
        "The fiend magically enters the Ethereal Plane from the Material Plane, or vice versa."
      ]
    }
  ]
}