{
  "name": "Ulitharid",
  "slug_name": "ulitharid",
  "tags": [
    "large",
    "aberration",
    "cr9",
    "volos-guide"
  ],
  "size": "Large",
  "type": "aberration",
  "subtype": null,
  "aligntment": "lawful evil",
  "armor_class": "15",
  "armor_class_type": "breastplate",
  "hit_points": "127",
  "hit_dice": "17d10+14",
  "speed": "30 ft.",
  "strength": "15",
  "strength_modifier": "+2",
  "dexterity": "12",
  "dexterity_modifier": "+1",
  "constitution": "15",
  "constitution_modifier": "+2",
  "intelligence": "21",
  "intelligence_modifier": "+5",
  "wisdom": "19",
  "wisdom_modifier": "+4",
  "charisma": "21",
  "charisma_modifier": "+5",
  "saving_throws": "Int +9, Wis +8, Cha +9",
  "skills": "Arcana +9, Insight +8, Perception +8, Stealth +5",
  "damage_resistances": null,
  "damage_immunities": null,
  "damage_vulnerabilities": null,
  "condition_immunities": null,
  "senses": "darkvision 120 ft.",
  "languages": "Deep Speech, Undercommon, telepathy 2 miles",
  "challenge_rating": "9",
  "challenge_rating_decimal": 9.0,
  "experience": "5,000 XP",
  "special_abilities": [
    {
      "name": "Creature Sense.",
      "descriptions": [
        "The ulitharid is aware of the presence of creatures within 2 miles of it that have an Intelligence score of 4 or higher. It knows the distance and direction to each creature, as well as each creature's intelligence score, but can't sense anything else about it. A creature protected by a mind blank spell, a nondetection spell, or similar magic can't be perceived in this manner."
      ]
    },
    {
      "name": "Magic Resistance.",
      "descriptions": [
        "The ulitharid has advantage on saving throws against spells and other magical effects."
      ]
    },
    {
      "name": "Psionic Hub.",
      "descriptions": [
        "If an elder brain establishes a psychic link with the ulitharid, the elder brain can form a psychic link with any other creature the ulitharid can detect using its Creature Sense. Any such link ends if the creature falls outside the telepathy ranges of both the ulitharid and the elder brain. The ulitharid can maintain its psychic link with the elder brain regardless of the distance between them, so long as they are both on the same plane of existence. lithe ulitharid is more than 5 miles away from the elder brain, it can end the psychic link at any time (no action required)."
      ]
    },
    {
      "name": "Innate Spellcasting (Psionics).",
      "descriptions": [
        "The ulitharid's innate spellcasting ability is Intelligence (spell save DC 17). It can innately cast the following spells, requiring no components:",
        "At will: detect thoughts, levitate",
        "1/day each: confusion, dominate monster, eyebite, feeblemind, mass suggestion, plane shift (self only), project image, scrying, telekinesis"
      ]
    }
  ],
  "actions": [
    {
      "name": "Tentacles.",
      "descriptions": [
        "Melee Weapon Attack: +9 to hit, reach 10 ft., one creature. Hit: 27 (4d10+5) psychic damage. If the target is Large or smaller, it is grappled (escape DC 14) and must succeed on a DC 17 Intelligence saving throw or be stunned until this grapple ends."
      ]
    },
    {
      "name": "Extract Brain.",
      "descriptions": [
        "Melee Weapon Attack: +9 to hit, reach 5 ft., one incapacitated humanoid grappled by the ulitharid. Hit: 55 (10d10) piercing damage. If this damage reduces the target to 0 hit points, the ulitharid kills the target by extracting and devouring its brain."
      ]
    },
    {
      "name": "Mind Blast (Recharge 5-6).",
      "descriptions": [
        "The ulitharid magically emits psychic energy in a 60-foot cone. Each creature in that area must succeed on a DC 17 Intelligence saving throw or take 31 (4d12+5) psychic damage and be stunned for 1 minute. A target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."
      ]
    }
  ]
}