{
  "name": "Vargouille",
  "slug_name": "vargouille",
  "tags": [
    "tiny",
    "fiend",
    "cr1",
    "volos-guide"
  ],
  "size": "Tiny",
  "type": "fiend",
  "subtype": null,
  "aligntment": "chaotic evil",
  "armor_class": "12",
  "armor_class_type": null,
  "hit_points": "13",
  "hit_dice": "3d4+6",
  "speed": "5 ft., fly 40 ft.",
  "strength": "6",
  "strength_modifier": "-2",
  "dexterity": "14",
  "dexterity_modifier": "+2",
  "constitution": "14",
  "constitution_modifier": "+2",
  "intelligence": "4",
  "intelligence_modifier": "-3",
  "wisdom": "7",
  "wisdom_modifier": "-2",
  "charisma": "2",
  "charisma_modifier": "-4",
  "saving_throws": null,
  "skills": null,
  "damage_resistances": "cold, fire, lightning",
  "damage_immunities": "poison",
  "damage_vulnerabilities": null,
  "condition_immunities": "poisoned",
  "senses": "darkvision 60 ft.",
  "languages": "understands Abyssal, Infernal, and any languages it knew before becoming a vargouille but can't speak",
  "challenge_rating": "1",
  "challenge_rating_decimal": 1.0,
  "experience": "200 XP",
  "actions": [
    {
      "name": "Bite.",
      "descriptions": [
        "Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 5 (1d6+2) piercing damage plus 10 (3d6) poison damage."
      ]
    },
    {
      "name": "Kiss .",
      "descriptions": [
        "The vargouille kisses one incapacitated humanoid within 5 feet of it. The target must succeed on a DC 12 Charisma saving throw or become cursed. The cursed target loses 1 point of Charisma after each hour, as its head takes on fiendish aspects. The curse doesn't advance while the target is in sunlight or the area of a daylight spell; don't count that time. When the cursed target's Charisma becomes 2, it dies, and its head tears from its body and becomes a new vargouille. Casting remove curse, greater restoration, or a similar spell on the target before the transformation is complete can end the curse. Doing so undoes the changes made to the target by the curse."
      ]
    },
    {
      "name": "Stunning Shriek.",
      "descriptions": [
        "The vargouille shrieks. Each humanoid and beast within 30 feet of the vargouille and able to hear it must succeed on a DC 12 Wisdom saving throw or be frightened until the end of the vargouille's next turn. While frightened in this way, a target is stunned. If a target's saving throw is successful or the effect ends for ft., the target is immune to the Stunning Shriek of all vargouilles for 1 hour."
      ]
    }
  ]
}