{
  "name": "Yan-C-Bin",
  "slug_name": "yan-c-bin",
  "tags": [
    "huge",
    "elemental",
    "cr18",
    "elemental-evil"
  ],
  "size": "Huge",
  "type": "elemental",
  "subtype": null,
  "alignment": "neutral evil",
  "armor_class": "22",
  "armor_class_type": null,
  "hit_points": "283",
  "hit_dice": "21d12+147",
  "speed": "50 ft., fly 150 ft.",
  "strength": "18",
  "strength_modifier": "+4",
  "dexterity": "24",
  "dexterity_modifier": "+7",
  "constitution": "24",
  "constitution_modifier": "+7",
  "intelligence": "16",
  "intelligence_modifier": "+3",
  "wisdom": "21",
  "wisdom_modifier": "+5",
  "charisma": "23",
  "charisma_modifier": "+6",
  "saving_throws": "Dex +13, Wis +11, Cha +12",
  "skills": null,
  "damage_resistances": "cold, fire, bludgeoning, piercing, and slashing from nonmagical weapons",
  "damage_immunities": "lightning, poison, thunder",
  "damage_vulnerabilities": null,
  "condition_immunities": "charmed, frightened, paralyzed, petrified, poisoned, prone, restrained",
  "senses": "blindsight 120 ft., passive perception 15",
  "languages": "Auran",
  "challenge_rating": "18",
  "challenge_rating_decimal": 18.0,
  "experience": "20,000 XP",
  "special_abilities": [
    {
      "name": "Air Form",
      "descriptions": [
        "Yan-C-Bin can enter a hostile creature’s space and stop there. He can move through a space as narrow as 1 inch wide without squeezing if air could pass through that space."
      ]
    },
    {
      "name": "Empowered Attacks.",
      "descriptions": [
        "Yan-C-Bin's slam attacks are treated as magical for the purpose of bypassing resistance and immunity to nonmagical weapons."
      ]
    },
    {
      "name": "Innate Spellcasting.",
      "descriptions": [
        "Yan-C-Bin's innate spellcasting ability is Charisma (spell save DC 20, +12 to hit with spell attacks). He can innately cast the following spells, requiring no material components: ",
        {
          "raw": "* At will: gust of wind, invisibility, lightning bolt",
          "hyperlinked": "* At will: <a href=\"/spell/gust-of-wind\">gust of wind</a>, <a href=\"/spell/invisibility\">invisibility</a>, <a href=\"/spell/lightning-bolt\">lightning bolt</a>"
        },
        {
          "raw": "* 2/day each: chain lightning, cloudkill, haste",
          "hyperlinked": "* 2/day each: <a href=\"/spell/chain-lightning\">chain lightning</a>, <a href=\"/spell/cloudkill\">cloudkill</a>, <a href=\"/spell/haste\">haste</a>"
        }
      ]
    },
    {
      "name": "Legendary Resistance (3/Day).",
      "descriptions": [
        "If Yan-C-Bin fails a saving throw, he can choose to succeed instead."
      ]
    },
    {
      "name": "Magic Resistance.",
      "descriptions": [
        "Yan-C-Bin has advantage on saving throws against spells and other magical effects."
      ]
    }
  ],
  "actions": [
    {
      "name": "Multiattack.",
      "descriptions": [
        "Yan-C-Bin makes two slam attacks."
      ]
    },
    {
      "name": "Slam.",
      "descriptions": [
        "Melee Weapon Attack: +14 to hit, reach 10 ft., one target. Hit: 20 (3d8 + 7) force damage plus 10 (3d6) lightning damage."
      ]
    },
    {
      "name": "Thundercrack (Recharges after a Short or Long Rest).",
      "descriptions": [
        " Yan-C-Bin unleashes a terrible thundercrack in a 100-foot-radius sphere centered on himself. All other creatures in the area must succeed on a DC 24 Constitution saving throw or take 31 (9d6) thunder damage and be deafened for 1 minute. On a successful save, a creature takes half as much damage and is deafened until the start of Yan-C-Bin’s next turn."
      ]
    },
    {
      "name": "Change Shape.",
      "descriptions": [
        "Yan-C-Bin polymorphs into a Medium humanoid. While in polymorphed form, a swirling breeze surrounds him, his eyes are pale and cloudy, and he loses the Air Form trait. He can remain in polymorphed form for up to 1 hour. Reverting to his true form requires an action."
      ]
    },
    {
      "name": "Summon Elementals (1/Day).",
      "descriptions": [
        "Yan-C-Bin summons up to three air elementals and loses 30 hit points for each elemental he summons. Summoned elementals have maximum hit points, appear within 100 feet of Yan-C-Bin, and disappear if Yan-C-Bin is reduced to 0 hit points."
      ]
    }
  ],
  "legendary_action_description": "Yan-C-Bin can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time, and only at the end of another creature's turn. Yan-C-Bin regains spent legendary actions at the start of its turn.",
  "legendary_actions": [
    {
      "name": "Peal of Thunder.",
      "descriptions": [
        "Yan-C-Bin unleashes a peal of thunder that can be heard out to a range of 300 feet. Each creature within 30 feet of Yan-C-Bin takes 5 (1d10) thunder damage."
      ]
    },
    {
      "name": "Teleport (Costs 2 Actions).",
      "descriptions": [
        "Yan-C-Bin magically teleports up to 120 feet to an unoccupied space he can see. Anything Yan-CBin is wearing or carrying is teleported with him."
      ]
    },
    {
      "name": "Suffocate (Costs 3 Actions).",
      "descriptions": [
        "Yan-C-Bin steals the air of one breathing creature he can see within 60 feet of him. The target must make a DC 21 Constitution saving throw. On a failed save, the target drops to 0 hit points and is dying. On a successful save, the target can’t breathe or speak until the start of its next turn."
      ]
    }
  ]
}
