{
  "name": "Yeth Hound",
  "slug_name": "yeth-hound",
  "tags": [
    "large",
    "fey",
    "cr4",
    "volos-guide"
  ],
  "size": "Large",
  "type": "fey",
  "subtype": null,
  "aligntment": "neutral evil",
  "armor_class": "14",
  "armor_class_type": "natural armor",
  "hit_points": "51",
  "hit_dice": "6d10+18",
  "speed": "40 ft., fly 40 ft. (hover)",
  "strength": "18",
  "strength_modifier": "+4",
  "dexterity": "17",
  "dexterity_modifier": "+3",
  "constitution": "16",
  "constitution_modifier": "+3",
  "intelligence": "5",
  "intelligence_modifier": "-3",
  "wisdom": "12",
  "wisdom_modifier": "+1",
  "charisma": "7",
  "charisma_modifier": "-2",
  "saving_throws": null,
  "skills": null,
  "damage_resistances": "bludgeoning, piercing, and slashing from nonmagical attacks not made with silvered weapons",
  "damage_immunities": null,
  "damage_vulnerabilities": null,
  "condition_immunities": "charmed, exhaustion, frightened",
  "senses": "darkvision 60 ft.",
  "languages": "understands Common, Elvish, and Sylvan but can't speak",
  "challenge_rating": "4",
  "challenge_rating_decimal": 4.0,
  "experience": "1,100 XP",
  "special_abilities": [
    {
      "name": "Keen Hearing and Smell.",
      "descriptions": [
        "The yeth hound has advantage on Wisdom (Perception) checks that rely on hearing or smell."
      ]
    },
    {
      "name": "Sunlight Banishment.",
      "descriptions": [
        "If the yeth hound starts its turn in sunlight, it is transported to the Ethereal Plane. While sunlight shines on the spot from which it vanished, the hound must remain in the Deep Ethereal. After sunset, it returns to the Border Ethereal at the same spot, whereupon it typically sets out to find its pack or its master. The hound is visible on the Material Plane while it is in the Border Ethereal, and vice versa, but it can't affect or be affected by anything on the other plane. Once it is adjacent to its master or a pack mate that is on the Material Plane, a yeth hound in the Border Ethereal can return to the Material Plane as an action."
      ]
    },
    {
      "name": "Telepathic Bond.",
      "descriptions": [
        "While the yeth hound is on the same plane of existence as its master, it can magically convey what it senses to its master, and the two can communicate telepathically with each other."
      ]
    }
  ],
  "actions": [
    {
      "name": "Bite.",
      "descriptions": [
        "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 11 (2d6+4) piercing damage, plus 14 (4d6) psychic damage if the target is frightened."
      ]
    },
    {
      "name": "Baleful Baying.",
      "descriptions": [
        "The yeth hound bays magically. Every enemy within 300 feet of the hound that can hear it must succeed on a DC 13 Wisdom saving throw or be frightened until the end of the hound's next turn or until the hound is incapacitated. A frightened target that starts its turn within 30 feet of the hound must use all its movement on that turn to get as far from the hound as possible, must finish the move before taking an action, and must take the most direct route, even if hazards lie that way. A target that successfully saves is immune to the baying of all yeth hounds for the next 24 hours."
      ]
    }
  ]
}